// 1. Запросите у пользователя его имя и выведите в ответ:
// «Привет, его имя!».
//
// const name = prompt('как тебя зовут?')
// alert(`Привет, ${name}`)


// 2. Запросите у пользователя год его рождения, посчитайте,
// сколько ему лет и выведите результат. Текущий год укажите
// в коде как константу.
//
// const userYear = Number(prompt('Введите свой год рождения: '))
// alert(`Вам ${2023 - userYear}`)


// 3. Запросите у пользователя длину стороны квадрата
// и выведите периметр такого квадрата.
//
// const side = Number(prompt('Введите сторону квадрата: '))
// alert(`Периметр квадрата: ${side * 4}`)


// 4. Запросите у пользователя радиус окружности и выведите
// площадь такой окружности.
//
// допустим тут говорят про площадь круга
//
// const radius = Number(prompt('Введите радиус круга: '))
// alert(`Площадь круга: ${3.14 * radius ** 2}`)


// 5. Запросите у пользователя расстояние в км между двумя
// городами и за сколько часов он хочет добраться. 
// Посчитайте скорость, с которой необходимо двигаться, чтобы
// успеть вовремя.
//
// const km = Number(prompt('Введите расстояние между городами'))
// const time = Number(prompt('Введите за сколько часов вы хотите доехать'))
// alert(`Расчётная скорость: ${km / time} km/h`)


// 6. Реализуйте конвертор валют. Пользователь вводит доллары, 
// программа переводит в евро. Курс валюты храните в константе.
//
// как уменьшить количество нулей?
//
// const exchangeRate = 0.92
// const dollar = Number(prompt('Введите количество долларов: '))
// alert(`Евро: ${dollar * exchangeRate}`)


// 7. Пользователь указывает объем флешки в Гб. Программа
// должна посчитать сколько файлов размером в 820 Мб помещается на флешку.
//
// const fileMb = 820
// const volume = Number(prompt('Введите объём флешки(ГБ): '))
// alert(`${(volume * 1024) / 820} файлов помещается на флешку`)


// 8. Пользователь вводит сумму денег в кошельке и цену одной
// шоколадки. Программа выводит сколько шоколадок может
// купить пользователь и сколько сдачи у него останется. 
//
// const money = Number(prompt('Сумма денег в кошельке: '))
// const price = Number(prompt('Цена одной шоколадки: '))
// alert(`Количество шоколоадок: ${money / price}`)


// 9. Запросите у пользователя трехзначное число и выведите
// его задом наперед. Для решения задачи вам понадобится
// оператор % (остаток от деления).
//
// const number = Number(prompt('Введите трехзначное число: '))
// const a = number % 10
// const b = (number - a) / 10 % 10
// const c = (number - a - b * 10) / 100
// alert(`Перевертыш: ${a * 100 + b * 10 + c}`)


// 10. Запросите у пользователя целое число и выведите в ответ,
// четное число или нет. В задании используйте логические
// операторы. В задании не надо использовать if или switch.
//
// const number = Number(prompt('Введите число: '))
// alert(number % 2 === 0 ? "чётное" : "нечётное")